### Import Necessary ENVIRONMENT VARIABLES from OS
(You need to set up these beforehand)

In [1]:
import os
host = os.getenv('MYSQL_HOST')
port = os.getenv('MYSQL_PORT')
user = "root"
password = os.getenv('MYSQL_PASSWORD')

In [2]:
# print(host)
# print(user)
# print(password)



### Install and Import the connector for python

In [3]:
import sys
!{sys.executable} -m pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /opt/homebrew/lib/python3.10/site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in /opt/homebrew/lib/python3.10/site-packages (from mysql-connector-python) (3.20.3)

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python3.10 -m pip install --upgrade pip

In [4]:
import mysql.connector

# Create Database



**connect**

In [7]:
mydb = mysql.connector.connect(
    host=host,
    user=user,
    password=password,
    auth_plugin='mysql_native_password',
)

mycursor = mydb.cursor()

<br>

**CREATE DATABASE IF NOT EXISTS**

In [8]:
mycursor.execute("CREATE DATABASE IF NOT EXISTS mydatabase")

<br>

**SHOW DATABASES**

In [9]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sys',)

# Connect to Database

In [10]:
mydb = mysql.connector.connect(
  host=host,
  user="root",
  password=password,
  database="mydatabase",
    auth_plugin='mysql_native_password'
)

In [11]:
mycursor = mydb.cursor()

<br>

**SHOW TABLES**

In [12]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

# Create Table

When creating a table, you should also create a column with a unique key for each record. i.e. **PRIMARY KEY**.

In [13]:
mycursor.execute("CREATE TABLE IF NOT EXISTS customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")

In [14]:
mycursor.execute("SHOW TABLES")
for x in mycursor:
  print(x)

('customers',)

# Insert into Table



``mycursor.execute(sql_cmd, val)``: Insert One Entry <br>
``mydb.commit()``: It is required to make the changes, otherwise no changes are made to the table. <br>
``mycursor.rowcount``: No. of rows

In [15]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

<br>

``mycursor.executemany(sql_cmd, val)``: Insert multiple entries

In [16]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"

val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

# SELECT from Table

``mycursor.fetchall()``: Fetch all results from the Table

In [17]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'John', 'Highway 21')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')
(8, 'Richard', 'Sky st 331')
(9, 'Susan', 'One way 98')
(10, 'Vicky', 'Yellow Garden 2')
(11, 'Ben', 'Park Lane 38')
(12, 'William', 'Central st 954')
(13, 'Chuck', 'Main Road 989')
(14, 'Viola', 'Sideway 1633')

## SELECT with Filter: WHERE

In [18]:
sql = "SELECT * FROM customers WHERE address = 'Park Lane 38'"

mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(11, 'Ben', 'Park Lane 38')

### Wildcard Characters: "%"

In [19]:
sql = "SELECT * FROM customers WHERE address LIKE '%way%'"

mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'John', 'Highway 21')
(9, 'Susan', 'One way 98')
(14, 'Viola', 'Sideway 1633')

# ORDER BY: Sort the Result 

``ORDER`` BY keyword sorts the result **ascending** by default.

In [20]:
sql = "SELECT * FROM customers ORDER BY name"

mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(3, 'Amy', 'Apple st 652')
(11, 'Ben', 'Park Lane 38')
(7, 'Betty', 'Green Grass 1')
(13, 'Chuck', 'Main Road 989')
(4, 'Hannah', 'Mountain 21')
(1, 'John', 'Highway 21')
(5, 'Michael', 'Valley 345')
(2, 'Peter', 'Lowstreet 4')
(8, 'Richard', 'Sky st 331')
(6, 'Sandy', 'Ocean blvd 2')
(9, 'Susan', 'One way 98')
(10, 'Vicky', 'Yellow Garden 2')
(14, 'Viola', 'Sideway 1633')
(12, 'William', 'Central st 954')

#### ORDER BY DESC

In [21]:
sql = "SELECT * FROM customers ORDER BY name DESC"

mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(12, 'William', 'Central st 954')
(14, 'Viola', 'Sideway 1633')
(10, 'Vicky', 'Yellow Garden 2')
(9, 'Susan', 'One way 98')
(6, 'Sandy', 'Ocean blvd 2')
(8, 'Richard', 'Sky st 331')
(2, 'Peter', 'Lowstreet 4')
(5, 'Michael', 'Valley 345')
(1, 'John', 'Highway 21')
(4, 'Hannah', 'Mountain 21')
(13, 'Chuck', 'Main Road 989')
(7, 'Betty', 'Green Grass 1')
(11, 'Ben', 'Park Lane 38')
(3, 'Amy', 'Apple st 652')

# DELETE FROM

In [22]:
sql = "DELETE FROM customers WHERE address = 'Mountain 21'"

mycursor.execute(sql)
mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

# UPDATE

In [23]:
sql = "UPDATE customers SET address = 'Canyon 123' WHERE address = 'Valley 345'"

mycursor.execute(sql)
mydb.commit()

print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

# LIMIT

In [24]:
sql = "SELECT * FROM customers LIMIT 5"

mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'John', 'Highway 21')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(5, 'Michael', 'Canyon 123')
(6, 'Sandy', 'Ocean blvd 2')

# JOIN

In [25]:
#mycursor.execute("CREATE TABLE customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")
sql = "DROP TABLE IF EXISTS orders"
mycursor.execute(sql)

sql = "DROP TABLE IF EXISTS products"
mycursor.execute(sql)

sql = "CREATE TABLE products (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), price VARCHAR(255))"
mycursor.execute(sql)
sql = "INSERT INTO products (name, price) VALUES (%s, %s)"
val = [
    ("macbook", "2000"),
    ("iphone", "1000"),
    ("apple watch", "500")
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "record(s) inserted.")

3 record(s) inserted.

In [26]:
sql = "CREATE TABLE orders (id INT AUTO_INCREMENT PRIMARY KEY, customer_id INT, product_id INT)"


mycursor.execute(sql)
sql = "INSERT INTO orders (customer_id, product_id) VALUES (%s, %s)"
val = [
    ("1", "1"),
    ("1", "2"),
    ("2", "3"),
    ("3", "3")
]
mycursor.executemany(sql, val)
mydb.commit()
print(mycursor.rowcount, "record(s) inserted.")

4 record(s) inserted.

In [27]:

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('customers',)
('orders',)
('products',)

## JOIN or INNER JOIN
By Default JOIN means the INNER JOIN:  Returns records that have matching values in both tables

In [28]:

sql = "SELECT \
    c.name, o.id\
    FROM customers c\
    JOIN orders o ON c.id = o.customer_id\
    "
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 1)
('John', 2)
('Peter', 3)
('Amy', 4)

# OUTER JOIN: LEFT JOIN
Returns all records from the left table, and the matched records from the right table

In [29]:
sql = "SELECT \
    c.name, o.id\
    FROM customers c\
    LEFT JOIN orders o ON c.id = o.customer_id\
    "
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 2)
('John', 1)
('Peter', 3)
('Amy', 4)
('Michael', None)
('Sandy', None)
('Betty', None)
('Richard', None)
('Susan', None)
('Vicky', None)
('Ben', None)
('William', None)
('Chuck', None)
('Viola', None)

# OUTER JOIN: RIGHT JOIN
Returns all records from the right table, and the matched records from the left table

In [30]:
sql = "SELECT \
    c.name, o.id\
    FROM customers c\
    RIGHT JOIN orders o ON c.id = o.customer_id\
    "
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 1)
('John', 2)
('Peter', 3)
('Amy', 4)

# OUTER JOIN: FULL JOIN
Returns all records when there is a match in either left or right table.
MYSQL Doesn't support FULL JOIN, so need to do work around.

In [31]:
sql = "SELECT\
    c.name, o.id\
    FROM customers c\
    LEFT JOIN orders o ON c.id = o.customer_id\
    UNION\
    SELECT\
    c.name, o.id\
    FROM customers c\
    RIGHT JOIN orders o ON c.id = o.customer_id\
    "
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 2)
('John', 1)
('Peter', 3)
('Amy', 4)
('Michael', None)
('Sandy', None)
('Betty', None)
('Richard', None)
('Susan', None)
('Vicky', None)
('Ben', None)
('William', None)
('Chuck', None)
('Viola', None)

# DROP TABLE

In [32]:
sql = "DROP TABLE customers"

mycursor.execute(sql)

#### DROP TABLE IF EXISTS

In [33]:
sql = "DROP TABLE IF EXISTS customers"
mycursor.execute(sql)
sql = "DROP TABLE IF EXISTS orders"
mycursor.execute(sql)
sql = "DROP TABLE IF EXISTS products"
mycursor.execute(sql)